INSERT INTO Logistics.dbo.Vehicle (VehicleType, MaxCargoWeightKg, MaxCargoVolume)
VALUES ('Car', 100, 100),
('Ship', 500, 500),
('Plane', 1000, 1000),
('Train', 2000, 2000);

INSERT INTO Logistics.dbo.Warehouse
DEFAULT VALUES;
INSERT INTO Logistics.dbo.Warehouse
DEFAULT VALUES;

INSERT INTO Logistics.dbo.Invoice (ID, RecipientAddress, SenderAddress, RecipientPhoneNumber,SenderPhoneNumber)
VALUES ('B012A4A2-5FFC-49E8-A855-671DA030CE4F', '13887, Черкаська область, місто Черкаси, пров. Мельникова, 35', '27689, Дніпропетровська область, місто Дніпро, вул. Урицького, 53','0663781770','0940151861'),
('2ACA14A4-3071-462A-82D6-A112A33A93E3', '77514, Миколаївська область, місто Миколаїв, вул. Різницька, 31', '27689, Дніпропетровська область, місто Дніпро, вул. Урицького, 53','+38(010)4903706','0940151861'),
('15403B88-7518-4244-BD20-A9F1063FFFAD', '81669, Чернівецька область, місто Чернівці, вул. Пирогова, 02', '27689, Дніпропетровська область, місто Дніпро, вул. Урицького, 53','0949634989','0940151861'),
('0B5DC2BE-2705-4DF6-A399-C5E0FB4CDBE6', '91006, Волинська область, місто Луцьк, пров. Копиленка, 32', '27689, Дніпропетровська область, місто Дніпро, вул. Урицького, 53','0911524520','0940151861'),

('9A9C3005-BF28-4BB7-BDF1-CF2C9E57BB11', '06828, Дніпропетровська область, місто Дніпро, просп. І. Франкa, 13', '27689, Дніпропетровська область, місто Дніпро, вул. Урицького, 53','380634933004','0940151861'),
('716F4CE1-FBB8-467A-9EDF-EE99004A8976', '96420, Рівненська область, місто Рівне, вул. Б. Грінченка, 73', '27689, Дніпропетровська область, місто Дніпро, вул. Урицького, 53','0984143100','0940151861'),

('B00F5EDD-A8DD-4663-82C6-EF84165CBC1B', '03593, Сумська область, місто Суми, пров. Львівська, 54', '27689, Дніпропетровська область, місто Дніпро, вул. Урицького, 53','380944921414','0940151861');

INSERT INTO Logistics.dbo.Cargo(ID, InvoiceID, VehicleID, WarehouseID,Volume,Weight)
VALUES (NEWID(), 'B012A4A2-5FFC-49E8-A855-671DA030CE4F',1,NULL,100,100),
(NEWID(), '2ACA14A4-3071-462A-82D6-A112A33A93E3',2,NULL,100,100),
(NEWID(), '15403B88-7518-4244-BD20-A9F1063FFFAD',3,NULL,100,100),
(NEWID(), '0B5DC2BE-2705-4DF6-A399-C5E0FB4CDBE6',4,NULL,100,100),

(NEWID(), '9A9C3005-BF28-4BB7-BDF1-CF2C9E57BB11',NULL,1,100,100),
(NEWID(), '716F4CE1-FBB8-467A-9EDF-EE99004A8976',NULL,1,100,100),

(NEWID(), 'B00F5EDD-A8DD-4663-82C6-EF84165CBC1B',NULL,2,100,100);





